{
  "version": "2.0.0",
  "generated": "2026-02-28T00:00:00Z",
  "plugins": [
    {
      "id": "the-one-ring",
      "name": "The One Ring",
      "version": "0.2.0",
      "category": "governance",
      "scope": "managed",
      "keywords": ["governance", "brand", "strategy", "policies", "alignment", "core-values", "consistency"],
      "bigPicture": "The org-wide governance layer. Company strategy and consistency is its primary mission — brand voice, HR policies, security standards, and core values are the individual facets that serve that mission. Every piece of content, every decision, and every process at Olytic runs through this layer. It is installed for all employees and cannot be disabled.",
      "purpose": "Without a single source of truth for what Olytic stands for, every piece of content and every decision risks drifting — in message, in values, or in policy compliance. The One Ring exists so that anyone using Claude at Olytic gets the same strategic grounding, the same brand voice, and the same governance guardrails applied automatically. It is the baseline that makes every other plugin coherent.",
      "useCases": [
        {
          "title": "Audit a guest blog post against brand standards",
          "description": "Paste a draft blog post and run /brand-check. The plugin scores it against all five messaging pillars, flags hollow superlatives like 'best-in-class', and catches any sentence that could describe a generic consultancy instead of Olytic specifically."
        },
        {
          "title": "Check whether a strategic decision aligns with current priorities",
          "description": "Describe a decision or action and run /strategy-check. It evaluates strategic fit (does this serve our current stage?), message alignment (does this differentiate us?), and values alignment (would we be proud of this at meeting #20?)."
        },
        {
          "title": "Run a full governance scan on a client proposal",
          "description": "Use the consistency-auditor agent before sending any high-stakes document. It covers all five facets: brand voice, strategy alignment, core values, HR norms, and security standards — and presents a summary scorecard before diving into detailed recommendations."
        },
        {
          "title": "Orient a new team member on everything that matters",
          "description": "Run the onboarding-guide agent. It asks whether the person is full-time, a contractor, or returning — and calibrates its walkthrough accordingly. Covers what Olytic is (and isn't), where we are right now, core values in practice, communication norms, and key rules."
        }
      ],
      "rulesets": [
        {
          "name": "Company Strategy & Core Values",
          "summary": "Primary governance skill. Business stage: early-stage GTM, next goal is first client. All work serves one of three purposes: build credibility, create visibility, enable conversion. Five strategic priorities with status: website/content, offering definition, first client acquisition, delivery framework, internal tooling. Core Values: Clarity over noise, Embedded partnership, Amplification not automation, Systems thinking, Earned expertise. Engagement models: fixed-fee assessments and retainers — no hourly consulting, staff aug, or software licenses. O/G/O philosophy: 'amplification not automation' is an architectural principle, not a tagline."
        },
        {
          "name": "Brand Standards",
          "summary": "Defines Olytic as a 'revenue systems firm' (not a consultancy, SaaS vendor, or agency). Enforces O/G/O as core positioning. ICP: SMB B2B with GTM teams, has RevOps manager but lacks tech strategy. Voice: expert and specific, opinionated, dry humor, structured (bullets/tables), 'we' positioning, mocks corporate-speak gently. Banned: hollow superlatives, text walls, emojis, salesy language, framing AI as replacing humans. Five messaging pillars: Systems not consulting, Amplification not automation, Closed-loop architecture, Embedded partnership, Revenue outcomes. Design: DM Sans font, Gold (#C8A96E) accent, warm off-white surfaces (#F7F7F5), near-black ink, clean flat layouts."
        },
        {
          "name": "HR Policies",
          "summary": "Culture: expertise over activity, ownership over tasks, directness over diplomacy, continuous improvement. Communication: default async, structured (bullets/headers), respond within 24h, meetings need agendas, document decisions. Work: fully remote, async-first, no mandated core hours, client-facing roles align to client hours. PTO: unlimited/flexible with advance notice. Sick leave: take it when needed. Holidays: US federal + regional with notice. Onboarding: access setup, plugin install, read company-strategy + brand-standards + security-policies, onboarding call with leadership. Professional development: budget exists, learning is expected, share knowledge back to team."
        },
        {
          "name": "Security Policies",
          "summary": "Four-tier data classification: Public (website/social, unrestricted), Internal (strategy/OKRs, Olytic-only), Confidential (client data/pricing, authorized only), Restricted (credentials/PII, encrypted, need-to-know). Client data: never expose without permission, anonymize all examples, don't store credentials in plugins. AI usage: never paste client data into public AI tools, always be the final quality gate (Governor principle). Credentials: never hardcode, use environment variables, rotate on team changes. Incident response: stop, document, notify leadership immediately — low bar for reporting."
        }
      ],
      "triggerConditions": {
        "narrative": "This plugin activates whenever your prompt touches company strategy, brand voice, core values, HR norms, or security rules. If Claude detects that the output will be external-facing content or references an internal policy or decision, The One Ring loads in the background. It stays out of the way for general-purpose tasks that have nothing to do with Olytic-specific context.",
        "activates": [
          "Write a blog post about RevOps",
          "Draft an email to a prospect",
          "Create a proposal for a potential client",
          "Check if this page sounds like Olytic",
          "Review this content for brand compliance",
          "What are our company priorities?",
          "Does this decision align with our values?",
          "Run a full governance scan on this document",
          "Orient this new hire on how we work",
          "What's our PTO policy?",
          "Can I share this client data externally?"
        ],
        "dormant": [
          "What's the weather today?",
          "Help me debug this Python script",
          "Explain how Git branching works",
          "Summarize this PDF for me",
          "Calculate the ROI of this investment"
        ]
      },
      "components": {
        "skills": [
          { "name": "Company Strategy & Core Values", "desc": "Vision, core values, current business stage, strategic priorities with status, engagement models, decision framework. The primary skill — load first." },
          { "name": "Brand Standards", "desc": "Voice rules, messaging pillars, ICP definition, competitive positioning, design system (color, typography, layout)" },
          { "name": "HR Policies", "desc": "Culture principles, communication norms, work hours, PTO, onboarding checklist, professional development, escalation guidance" },
          { "name": "Security Policies", "desc": "Data classification tiers, client data rules, AI usage policies, credential management, incident response" }
        ],
        "commands": [
          { "name": "/brand-check", "desc": "Scores content against voice & tone, messaging alignment, ICP targeting, competitive differentiation, structure, and CTA. Returns Pass/Needs Work with specific rewrites." },
          { "name": "/strategy-check", "desc": "Reviews any work product or decision against strategic fit, message alignment, and core values. Returns a scored table with specific recommendations for anything off-track." },
          { "name": "/policy-lookup", "desc": "Answers a specific HR or security policy question. Returns the rule, rationale, source section, and the right action for the user's situation." },
          { "name": "/values-check", "desc": "Quick gut-check against each of the five core values. Returns a pass/flag per value with a one-line rationale. Escalates to consistency-auditor for a full scan." }
        ],
        "agents": [
          { "name": "brand-compliance-reviewer", "desc": "Six-dimension brand audit: Voice & Tone, Messaging Alignment, ICP Targeting, Competitive Differentiation, Structural Quality, CTA. Verification gate before full report. Rewrite examples for all failures." },
          { "name": "consistency-auditor", "desc": "Full cross-dimensional governance scan: brand voice, strategy alignment, core values, HR norms, security standards. Presents summary scorecard first, then drills into flagged dimensions on request." },
          { "name": "onboarding-guide", "desc": "Interactive orientation for new team members and collaborators. Calibrates depth by role (full-time, contractor, returning). Covers strategy, values, brand voice, communication norms, and key policies." }
        ]
      },
      "successCriteria": {
        "narrative": "The One Ring succeeds when Olytic's brand voice, strategic alignment, and policies are applied consistently across all outputs without requiring manual correction. The primary signal is governance scan pass rate. Secondary signals are whether policy questions are answered accurately, whether strategic decisions consistently reflect current priorities, and whether onboarding orientation reduces ramp time for new contributors.",
        "kpis": [
          { "metric": "/brand-check first-run pass rate", "target": ">80% of content passes all dimensions without revision", "reporting": "Manual log after each /brand-check run. Track Pass vs. Needs Work per dimension in a running Notion table." },
          { "metric": "consistency-auditor scan pass rate", "target": ">90% of high-stakes documents pass all five governance facets on first scan", "reporting": "Log summary scorecard output after each consistency-auditor run. Track by document type (proposal, email, landing page)." },
          { "metric": "Policy question accuracy", "target": "HR and security questions answered without requiring human correction", "reporting": "Spot-check during weekly review. Note any answers that needed correction in a running issues log." },
          { "metric": "External content retraction rate", "target": "Zero published pieces need to be pulled back for brand or policy violations", "reporting": "Tracked reactively. Any retraction triggers a root-cause review against the relevant skill." }
        ]
      },
      "guardrails": [
        "Never write fluffy thought leadership. No 'rapidly evolving landscapes.'",
        "Never use hollow superlatives: 'best-in-class', 'world-class', 'cutting-edge'.",
        "Never position Olytic as a consulting firm or SaaS vendor.",
        "Never suggest AI replaces humans. Always frame as amplification.",
        "Never be salesy or pushy. Let the expertise speak.",
        "No emojis in professional content.",
        "Never expose client data or credentials in any output."
      ],
      "setup": [
        { "name": "Managed Scope", "desc": "Installed org-wide. Users cannot disable it.", "status": "ok" },
        { "name": "Company Strategy & Core Values", "desc": "Vision, priorities, engagement models, and Core Values populated", "status": "ok" },
        { "name": "Brand Standards", "desc": "Voice, messaging, ICP, competitive positioning, and design system fully specified", "status": "ok" },
        { "name": "HR Policies", "desc": "Working defaults populated for all sections. Review with leadership to confirm or adjust.", "status": "ok" },
        { "name": "Security Policies", "desc": "Core rules and incident response populated. Review before enforcing in client engagements.", "status": "ok" }
      ]
    },
    {
      "id": "olytic-content-strategist",
      "name": "Content Strategist",
      "version": "0.1.0",
      "category": "content",
      "scope": "user",
      "keywords": ["content", "website", "github", "analytics", "strategy", "ga4"],
      "bigPicture": "Handles content operations end-to-end: deciding what to write, producing it, pushing it to GitHub, and measuring how it performed. It reads from GA4 (Property 525690219), pulls and pushes to the olytic-site repo, and applies the Content O/G/O loop (draft, review against brand standards, optimize from analytics). Requires The One Ring for brand voice.",
      "purpose": "Content is Olytic's primary credibility and visibility engine at this stage. This plugin exists to close the gap between 'we should publish more' and actually doing it. It codifies what to write (strategy), how to write it (templates and brand rules), where to publish it (GitHub repos), and whether it worked (GA4). Without it, content production stalls or goes off-strategy.",
      "useCases": [
        {
          "title": "Write a blog post about Salesforce CPQ amendments, push it to GitHub",
          "description": "Say 'write a blog post about managing amendments in Salesforce CPQ.' The website-content skill loads the HTML template structure, the brand-standards skill (from The One Ring) sets the voice, and the content-strategy skill confirms this maps to the Revenue Systems Expertise pillar. When done, /push-content stages it on a feature branch in olytic-site."
        },
        {
          "title": "Pull the homepage, audit it, and push a revised version",
          "description": "Run /pull-content to fetch index.html from the olytic-site repo. Run /brand-check to score it. Edit the sections that scored 'Needs Work.' Run /push-content to push the updated version to a feature branch for review."
        },
        {
          "title": "Ask 'What should we write next?' and get a prioritized recommendation",
          "description": "The content-strategist agent evaluates your current content against the ICP journey (Awareness, Consideration, Decision), scores topic candidates on ICP Pain, Differentiation, Search Potential, Stage Coverage, and First Client Impact, then recommends the highest-value piece to create next."
        },
        {
          "title": "Analyze which blog posts are driving traffic and which are dead weight",
          "description": "Run /content-performance. It pulls GA4 data (pageviews, time on page, scroll depth, conversions) and maps each page to its strategic purpose (credibility, visibility, conversion). You get a clear picture of what's working and what to rewrite or retire."
        }
      ],
      "rulesets": [
        {
          "name": "Content Strategy",
          "summary": "Three content pillars mapped to Olytic's three uniques: Revenue Systems Expertise (CPQ, RevOps, Salesforce), The Olytic Model (O/G/O in practice), Strategic Value Creation (AI strategy for GTM). ICP content journey: Awareness (educate via blog posts) → Consideration (differentiate via comparisons and deep-dives) → Decision (convert via landing pages and assessment offers). Prioritization scoring: ICP Pain (high), Differentiation (high), Search Potential (medium), Stage Coverage (medium), First Client Impact (high). Content O/G/O loop: Operator drafts, Governor reviews via /brand-check, Optimizer analyzes via GA4. Target cadence: 2 blog posts/month, 1 landing page/month."
        },
        {
          "name": "Website Content",
          "summary": "Blog post structure: specific expert-level title, subtitle, TOC for 4+ sections, H2 per distinct idea, bullet-heavy body, structured scenario formats, subtle CTA. Length: 1,500-3,000 words. Landing page structure: hero with outcome headline + single CTA, problem bullets in ICP language, solution referencing O/G/O, 3-step 'how it works', comparison table, social proof, repeated CTA. HTML rules: semantic elements, <strong> for scannability, <table> for comparisons, meta description for ICP search intent. SEO: long-tail keywords ('AI for revenue operations', 'RevOps AI strategy for SMBs'), keyword in H1 and first paragraph, no stuffing."
        }
      ],
      "triggerConditions": {
        "narrative": "This plugin activates when your prompt involves creating, editing, publishing, or measuring website content. Any mention of blog posts, landing pages, pulling or pushing to the site repo, content planning, or performance analytics will load the relevant skills. It does not activate for governance questions, plugin creation, or general development tasks.",
        "activates": [
          "Write a blog post about RevOps AI",
          "Create a landing page for our assessment offering",
          "Pull the homepage from GitHub",
          "Push this updated page to the repo",
          "What should we write next?",
          "How is our content performing?",
          "Research what competitors are writing about",
          "Review this meeting transcript for content ideas"
        ],
        "dormant": [
          "What's our PTO policy?",
          "Check this proposal for brand compliance",
          "Create a new plugin for the sales team",
          "What are our security rules for client data?",
          "Help me configure a GitHub Action"
        ]
      },
      "components": {
        "skills": [
          { "name": "Website Content", "desc": "HTML templates for blog posts and landing pages, content formatting rules, SEO guidance, content planning checklist" },
          { "name": "Content Strategy", "desc": "Three content pillars, ICP journey mapping, prioritization scoring framework, GA4 integration, Content O/G/O loop, publishing cadence" }
        ],
        "commands": [
          { "name": "/pull-content", "desc": "Fetches a file from any Olytic GitHub repo (olytic-site, olytic-lab, olytic-plugins, olytic-app) for review or editing" },
          { "name": "/push-content", "desc": "Pushes new or updated content to an Olytic GitHub repo on a feature branch. Never auto-merges to main." },
          { "name": "/content-performance", "desc": "Pulls GA4 data (Property 525690219) and maps page metrics to strategic purposes (credibility, visibility, conversion)" }
        ],
        "agents": [
          { "name": "content-strategist", "desc": "Evaluates content gaps against ICP journey and prioritization framework. Recommends what to write next with scoring rationale." },
          { "name": "competitive-content-analyst", "desc": "Researches competitor content and messaging. Identifies positioning angles only Olytic can credibly own." },
          { "name": "meeting-notes-reviewer", "desc": "Extracts content ideas, ICP language patterns, and objection data from meeting transcripts." }
        ]
      },
      "successCriteria": {
        "narrative": "The Content Strategist succeeds when Olytic is publishing on cadence, the content maps to the right stage of the ICP journey, and organic traffic is growing. It fails silently if content is published but not measured, or if the publishing cadence drops because the workflow feels too heavy. The reporting mechanism is /content-performance, which pulls GA4 data directly and maps it to strategic purpose.",
        "kpis": [
          { "metric": "Publishing cadence", "target": "2 blog posts and 1 landing page per month", "reporting": "GitHub commit history on olytic-site. Count merged PRs from /push-content per month." },
          { "metric": "Organic pageviews", "target": "Month-over-month growth on content pages", "reporting": "/content-performance command pulling GA4 Property 525690219. Reviewed monthly." },
          { "metric": "Content-to-ICP-journey coverage", "target": "At least one piece covering each stage: Awareness, Consideration, Decision", "reporting": "content-strategist agent produces a gap analysis on demand. Run before each monthly planning session." },
          { "metric": "Brand-check pass rate on published content", "target": "100% of content pushed via /push-content has passed /brand-check", "reporting": "Enforced by process: /brand-check is a required step before /push-content. Verified in PR description." }
        ]
      },
      "guardrails": [
        "Requires The One Ring. Brand voice comes from there, not here.",
        "Every piece of content must map to: build credibility, create visibility, or enable conversion.",
        "Default to olytic-site repo for website content unless specified otherwise.",
        "GA4 Property ID 525690219 is hardcoded. Update in content-strategy SKILL.md if it changes.",
        "Never publish content that hasn't been through /brand-check.",
        "All repo changes are staged on feature branches. Never auto-merges to main."
      ],
      "setup": [
        { "name": "The One Ring (Dependency)", "desc": "Required. Brand voice and strategy come from here.", "status": "ok" },
        { "name": "GitHub MCP Server", "desc": "Required for /pull-content, /push-content, and repo access", "status": "warn" },
        { "name": "GA4 Property (525690219)", "desc": "Required for /content-performance command", "status": "warn" },
        { "name": "Website Content Skill", "desc": "Templates and HTML patterns loaded", "status": "ok" },
        { "name": "Content Strategy Skill", "desc": "Pillars, ICP journey, prioritization framework loaded", "status": "ok" }
      ]
    },
    {
      "id": "olytic-plugin-creator",
      "name": "Plugin Creator",
      "version": "0.1.0",
      "category": "meta",
      "scope": "user",
      "keywords": ["plugin-creation", "meta-plugin", "marketplace", "telemetry", "generation"],
      "bigPicture": "Builds new plugins and manages the Olytic marketplace. Runs a 7-question discovery to gather requirements, generates all plugin files (skills, commands, agents, hooks, MCP configs), injects telemetry into every output, and stages marketplace updates on feature branches. Works for both internal Olytic plugins and client-facing ones.",
      "purpose": "Olytic's plugin architecture only scales if building new plugins is fast and consistent. This plugin exists to turn a set of requirements into a fully structured, telemetry-equipped plugin in one session instead of a week of manual file creation. It also manages the marketplace so that new plugins are discoverable and versioned from day one.",
      "useCases": [
        {
          "title": "Build a 'Sales Enablement' plugin for the sales team from scratch",
          "description": "Run /create-plugin. The 7-question discovery asks: plugin name, purpose, target users, strategic questions, constraints, integrations needed, and success metrics. From those answers, the plugin-builder agent generates the full file structure: skills, commands, agents, plugin.json manifest, and a telemetry skill. You review and ship."
        },
        {
          "title": "Add a new plugin to the Olytic marketplace after building it",
          "description": "Run /update-marketplace with the plugin directory. It reads the current marketplace.json, diffs the changes, generates an updated entry, and pushes everything to a feature branch in olytic-plugins for review. The catalog page auto-updates when the PR is merged."
        },
        {
          "title": "Generate a client-facing plugin with embedded telemetry",
          "description": "Every plugin generated by this tool automatically includes a telemetry skill that logs usage events, version tags, constraint violations, and user feedback. This is not optional. The telemetry skill is injected into the output regardless of whether you ask for it."
        }
      ],
      "rulesets": [
        {
          "name": "Plugin Discovery",
          "summary": "Seven-question dynamic protocol that adapts based on answers. Questions cover: plugin name and one-liner, primary purpose, target user roles, strategic questions about the domain, operational constraints, required integrations (MCP servers, APIs), and success/quality metrics. Output is a structured requirements document that feeds into the generation phase."
        },
        {
          "name": "Plugin Generation",
          "summary": "Generates all plugin files from discovery output using reference templates for every component type (skills, commands, agents, hooks, MCP configs). Follows Olytic's agentic best practices: verification gates after every write, progressive disclosure in skills, clear frontmatter with trigger descriptions, and structured agent definitions with tool restrictions. Every generated plugin includes auto-injected telemetry."
        },
        {
          "name": "Marketplace Management",
          "summary": "Reads the current marketplace.json from SupportOlyticSolutions/olytic-plugins, diffs proposed changes, and stages updates on feature branches. Manages catalog.json entries for the dynamic plugin catalog page. Never auto-merges to main. All changes go through human review."
        }
      ],
      "triggerConditions": {
        "narrative": "This plugin activates when your prompt is about building, scaffolding, or managing plugins themselves. If you ask to create a new plugin, update the marketplace, or start the plugin creation workflow, it loads. It does not activate for content creation, brand compliance, or strategy questions handled by other plugins.",
        "activates": [
          "Create a new plugin",
          "Build a plugin for the consulting team",
          "Add this plugin to the marketplace",
          "Update the marketplace with the new version",
          "Generate a plugin from these requirements",
          "Start the plugin creation workflow"
        ],
        "dormant": [
          "Write a blog post",
          "Check this content for brand compliance",
          "What's our company strategy?",
          "Pull a page from GitHub to edit",
          "How is our content performing?"
        ]
      },
      "components": {
        "skills": [
          { "name": "Plugin Discovery", "desc": "7-question adaptive protocol: name, purpose, users, strategic questions, constraints, integrations, metrics" },
          { "name": "Plugin Generation", "desc": "Generates complete plugin file structures from discovery output using reference templates for all component types" },
          { "name": "Marketplace Management", "desc": "Reads, diffs, and stages updates to the olytic-plugins marketplace repo" }
        ],
        "commands": [
          { "name": "/create-plugin", "desc": "Starts the full guided workflow: discovery through delivery" },
          { "name": "/update-marketplace", "desc": "Stages a plugin addition or update in the marketplace repo on a feature branch" }
        ],
        "agents": [
          { "name": "plugin-builder", "desc": "End-to-end orchestrator for the 6-phase workflow: discovery, planning, generation, review, delivery, marketplace" }
        ]
      },
      "successCriteria": {
        "narrative": "The Plugin Creator succeeds when new plugins are shipped quickly, are structurally consistent with existing ones, and get actively used after delivery. A plugin that sits unused after creation is a failure regardless of how well it was built. Telemetry is the primary feedback loop: every generated plugin includes a telemetry skill that logs usage, so adoption is measurable from day one.",
        "kpis": [
          { "metric": "Time from requirements to delivered plugin", "target": "Under 2 hours for a standard plugin with 2-3 skills and 1-2 commands", "reporting": "Logged manually at delivery. Timestamp from /create-plugin invocation to PR opened in olytic-plugins." },
          { "metric": "Structural compliance rate", "target": "100% of generated plugins pass the plugin-builder verification gates without manual fixes", "reporting": "Verification gate output is included in the delivery summary. Any manual fixes are noted in the PR description." },
          { "metric": "Plugin adoption rate", "target": "At least one active user logging telemetry events within 2 weeks of delivery", "reporting": "Telemetry skill logs reviewed via the olytic-lab repo or designated telemetry dashboard. Reviewed per plugin at the 2-week mark." },
          { "metric": "Marketplace currency", "target": "catalog.json reflects all active plugins within 24 hours of delivery", "reporting": "GitHub commit history on olytic-plugins. /update-marketplace should be run as the final step of every plugin delivery." }
        ]
      },
      "guardrails": [
        "Every generated plugin includes a telemetry skill. No exceptions.",
        "Telemetry logs: usage events, version tags, constraint violations, user feedback.",
        "Marketplace changes are staged on feature branches. Never auto-merged.",
        "Verification gates run after every write operation. No silent failures.",
        "No hallucination: if a file or data point isn't found, report 'Not Found' immediately.",
        "Permission gates: confirm with user before destructive actions or 5+ simultaneous changes."
      ],
      "setup": [
        { "name": "GitHub MCP Server", "desc": "Required for marketplace management and repo operations", "status": "warn" },
        { "name": "Plugin Generation References", "desc": "Templates, patterns, and best practices loaded", "status": "ok" },
        { "name": "Discovery Protocol", "desc": "7-question flow configured and ready", "status": "ok" },
        { "name": "Telemetry Template", "desc": "Auto-included in every generated plugin", "status": "ok" }
      ]
    }
  ]
}
